[
  {
    "id": 1,
    "title": "Opor ayam recipe",
    "submitter": "John Doe",
    "image": "opor_ayam.jpg",
    "description": "Opor ayam is a type of chicken curry that is very well known in Indonesia. This cuisine has been widely known in other areas. In fact, almost all over Indonesia. Opor ayam is actually boiled chicken that is given a thick seasoning of coconut milk which is added with various spices such as lemongrass, galangal, and so on.",
    "category": "Lunch",
    "ingredients": [
      " 500 grams Chicken",
      "2 bay leaves",
      "1 lemongrass",
      "1 galangal",
      "2 lime leaves",
      "1 teaspoon salt",
      "1/2 teaspoon sugar",
      "600 ml thin coconut milk",
      "600 ml thick coconut milk",
      "3 tablespoons of cooking oil",
      "5 red onions",
      "3 cloves of garlic",
      "3 hazelnuts",
      "2 cm ginger",
      "2 cm roasted turmeric",
      "1 teaspoon coriander",
      "1/2 teaspoon peppercorns"
    ],
    "steps": [
      "grind all the spices",
      "Bruised galangal and lemongrass.",
      "Tear the lime leaves, remove the stalks, set aside.",
      "Heat oil in a frying pan, then saute ground spices, lemon grass, galangal, and lime leaves until fragrant.",
      "Enter the bay leaf and chicken that has been cut into pieces, mix well. Cook until the chicken changes color",
      "Enter the thin coconut milk, cook until boiling.",
      "Add salt and sugar, mix well. Cover the pot, cook until the chicken is tender and the spices are absorbed.",
      "Add thick coconut milk, cook until boiling.",
      "Correct the taste, if it's right turn off the stove.",
      "Serve the chicken stock with a sprinkling of fried shallots."
    ]
  },
  {
    "id": 2,
    "title": "Rendang ayam recipe",
    "submitter": "John Doe",
    "image": "rendang_ayam.jpg",
    "description": "Rendang or randang in the Minangkabau language is a dish made from native Indonesian meat originating from Minangkabau. This dish is produced from a low temperature cooking process for a long time using various spices and coconut milk and rendang is not only made from beef but can be varied, such as chicken.",
    "category": "Lunch",
    "ingredients": [
      "1 kg chicken, cut into 10 parts",
      "100 grams of grated coconut, roasted and then pounded until smooth",
      "3 lemongrass stalks",
      "3 cm galangal",
      "3 bay leaves",
      "5 lime leaves",
      "1 sheet of turmeric leaf",
      "3 cm cinnamon",
      "2 cloves",
      "2 grains of kandis acid",
      "2 teaspoon salt",
      "1 teaspoon sugar",
      "1 liter coconut milk",
      "7 red onions",
      "6 cloves of garlic",
      "20 pieces of curly red chili",
      "4 pecans",
      "3 cm ginger",
      "3 cm turmeric",
      "1/2 teaspoon pepper powder",
      "1/2 teaspoon coriander powder",
      "1/2 teaspoon nutmeg powder"
    ],
    "steps": [
      "Heat some oil. Saute ground spices until fragrant.",
      "Add lemongrass, galangal, all the spices, cinnamon, cloves, and kandis acid. Stir well.",
      "Add chicken, salt and sugar. Stir well and cook until the chicken changes color.",
      "Pour the coconut milk little by little. Stir well and cook until the water recedes.",
      "Add the roasted coconut. Stir well and cook again until boiling. Lift.",
      "Ready to be served."
    ]
  },
  {
    "id": 3,
    "title": "Fried rice recipe",
    "submitter": "John Doe",
    "image": "nasi_goreng.jpg",
    "description": "Fried rice is a food in the form of fried rice and stirred in cooking oil, margarine, or butter. Usually, sweet soy sauce, shallots, garlic, tamarind, pepper and other spices are added; such as eggs, chicken, and crackers.",
    "category": "Dinner",
    "ingredients": [
      "1 plate of white rice",
      "2 cloves garlic, finely chopped",
      "Sweet soy sauce or soy sauce ",
      "Chili sauce ",
      "Oyster sauce ",
      "Salt t",
      "Chicken or beef flavored powder broth",
      "1 spring onion, finely chopped",
      "1 chicken egg",
      "1 piece of chicken sausage, thinly sliced",
      "Margarine or 3 tablespoon of cooking oil"
    ],
    "steps": [
      "Prepare a frying pan over medium heat, pour margarine or cooking oil.",
      "Add the finely chopped onion and garlic. Saute until fragrant or until golden in color.",
      "Add sausage and 1 chicken egg. Saute for a while.",
      "Add ground spices and rice. Stir until well blended",
      "Pour in the sweet soy sauce, chili sauce, oyster sauce, salt, and powdered stock. Stir until the color of the rice changes evenly.",
      "Simple and delicious plain fried rice is ready to be served."
    ]
  },
  {
    "id": 4,
    "title": "Soto ayam recipe",
    "submitter": "John Doe",
    "image": "soto_ayam.jpg",
    "description": "Soto ayam is a typical Indonesian food in the form of a kind of chicken soup with a yellowish gravy. The yellow color is due to turmeric which is used as a spice. Soto ayam can be found in many areas in Indonesia and Singapore.",
    "category": "Breakfast",
    "ingredients": [
      "12 chicken feet",
      "4 pieces of chicken wings",
      "4 pieces of chicken heads",
      "1 piece of chicken breast",
      "1 liter of water",
      "6 red onions",
      "6 cloves of garlic",
      "3 cm turmeric",
      "crushed 3 cm ginger",
      "1/2tsp pepper powder",
      "4 candlenuts",
      "2 lemongrass stalks",
      "crushed 5 lime leaves",
      "1 galangal segment ",
      "crushed 2 bay leaves"
    ],
    "steps": [
      "Boil the feet, wings, head, and chicken breast meat with lemon grass, lime leaves, bay leaves, galangal, ginger using a small stove fire. If the chicken is cooked, remove the chicken breast, fry, drain and then shred.",
      "Puree the onion, garlic, candlenut, ginger, pepper, and turmeric.",
      "Saute the spices that have been mashed until you can smell the aroma. Add to the broth and bring to a boil again. Add salt and sugar to taste, stir and cook until boiling and cooked."
    ]
  },
  {
    "id": 5,
    "title": "Sayur asem",
    "submitter": "John Doe",
    "image": "sayur_asem.jpg",
    "description": "Vegetable tamarind is a favorite dish of many people. Besides being easy to make, it's also refreshing. The hallmark of the vegetable tamarind is the combination of a prominent sour taste, there is sweetness, salty and even spicy taste, the variety of vegetables in it is very diverse. The sour taste of this dish is usually obtained from tomatoes, Javanese tamarind, or from wuluh starfruit. No, it's wrong if this vegetable tamarind is suitable for Indonesian tongues.",
    "category": "Lunch",
    "ingredients": [
      "1 sweet corn, cut into pieces",
      "100 g young melinjo",
      "2 cm galangal, bruised",
      "2 bay leaves",
      "1 chayote, cut into pieces",
      "5 pieces of long beans, cut into pieces",
      "50 g of young melinjo leaves",
      "3 young sour",
      "1 small piece of palm sugar",
      "8 curly red chilies",
      "5 pieces of red chili",
      "5 red onions",
      "3 cloves of garlic",
      "4 pecans",
      "1 piece of grilled shrimp paste",
      "2 tsp salt"
    ],
    "steps": [
      "Boil enough water in a saucepan, boil the corn and melinjo fruit until soft.",
      "In a separate saucepan, boil young tamarind with a little water until soft. Remove, knead, filter the water about 100 ml.",
      "Seasonings: Grind or mash any spice ingredients until smooth.",
      "Add the spices and sugar to the corn stew, along with the galangal and bay leaf.",
      "Add chayote and long beans. Boil until soft.",
      "Add melinjo leaves and young tamarind water, bring to a boil again.",
      "Remove and serve warm."
    ]
  }
]
